CSI API ETABS v1

# cLoadCasesSetDesignType Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetDesignType(
    	string Name,
    	int DesignTypeOption,
    	eLoadPatternType DesignType = eLoadPatternType.Dead
    )

    Function SetDesignType (
    	Name As String,
    	DesignTypeOption As Integer,
    	Optional DesignType As eLoadPatternType = eLoadPatternType.Dead
    ) As Integer

    Dim instance As cLoadCases
    Dim Name As String
    Dim DesignTypeOption As Integer
    Dim DesignType As eLoadPatternType
    Dim returnValue As Integer

    returnValue = instance.SetDesignType(Name,
    	DesignTypeOption, DesignType)

    int SetDesignType(
    	String^ Name,
    	int DesignTypeOption,
    	eLoadPatternType DesignType = eLoadPatternType::Dead
    )

    abstract SetDesignType :
            Name : string *
            DesignTypeOption : int *
            ?DesignType : eLoadPatternType
    (* Defaults:
            let _DesignType = defaultArg DesignType eLoadPatternType.Dead
    *)
    -> int

#### Parameters

Name

    Type: SystemString

DesignTypeOption

    Type: SystemInt32

DesignType (Optional)

    Type: ETABSv1eLoadPatternType

#### Return Value

Type: Int32

See Also

#### Reference

cLoadCases Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com